# SetRodLockedWithHost Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..SetRodLockedWithHost Method
FabricationRodInfo Class See Also
---
Locks the rod with the host. The method is applicable only for bearer hanger.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetRodLockedWithHost(
	int rodIndex,
	bool locked
)
```

Visual Basic
---
```text
Public Sub SetRodLockedWithHost ( _
	rodIndex As Integer, _
	locked As Boolean _
)
```

Visual C++
---
```text
public:
void SetRodLockedWithHost(
	int rodIndex,
	bool locked
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The index of the rod.
locked
    Type: System..::..Boolean Locks the rod with the host.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The hanger is not a bearer hanger. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace